





Network Working Group                                       Luca Martini
Internet Draft                                       Cisco Systems, Inc.
Expiration Date: July 2006                               Nasser El-Aawar
                                            Level 3 Communications, LLC.

Steve Vogelsang                                            Daniel Tappan
John Shirron                                               Eric C. Rosen
Toby Smith                                                 Alex Hamilton
Laurel Networks, Inc.                                Jayakumar Jayakumar
                                                     Cisco Systems, Inc.

Vasile Radoaca                                  Dimitri Stratton Vlachos
Nortel Networks                                      Mazu Networks, Inc.

Andrew G. Malis                                       Chris Liljenstolpe
Vinai Sirkay                                            Cable & Wireless
Vivace Networks, Inc.
                                                             Giles Heron
Dave Cooper                                          PacketExchange Ltd.
Global Crossing
                                                        Kireeti Kompella
                                                        Juniper Networks

                                                            January 2006


                 Transport of Layer 2 Frames Over MPLS


               draft-martini-l2circuit-trans-mpls-17.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.


   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups. Note that other
   groups may also distribute working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time. It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."




Martini, et al.                                                 [Page 1]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/1id-abstracts.html

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

Abstract

   This document describes methods for transporting the Protocol Data
   Units (PDUs) of layer 2 protocols such as Frame Relay, ATM AAL5,
   Ethernet, and providing a SONET circuit emulation service across an
   MPLS network.







































Martini, et al.                                                 [Page 2]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006




Table of Contents

    1      Specification of Requirements  ..........................   4
    2      Special Note  ...........................................   4
    3      Introduction  ...........................................   4
    4      Tunnel Labels and VC Labels  ............................   5
    5      Protocol-Specific Details  ..............................   6
    5.1    Frame Relay  ............................................   6
    5.2    ATM  ....................................................   7
    5.2.1  ATM AAL5 VCC Transport  .................................   7
    5.2.2  ATM Transparent Cell Transport  .........................   7
    5.2.3  ATM VCC and VPC Cell Transport  .........................   7
    5.2.4  OAM Cell Support  .......................................   7
    5.2.5  ILMI Support  ...........................................   8
    5.3    Ethernet VLAN  ..........................................   8
    5.4    Ethernet  ...............................................   9
    5.5    HDLC  ...................................................   9
    5.6    PPP  ....................................................   9
    6      LDP  ....................................................   9
    6.1    Interface Parameters Field  .............................  11
    6.2    C Bit handling procedures  ..............................  13
    6.2.1  VC types for which the control word is REQUIRED  ........  13
    6.2.2  VC types for which the control word is NOT mandatory  ...  13
    6.2.3  Status codes  ...........................................  16
    6.3    LDP label Withdrawal procedures  ........................  16
    6.4    Sequencing Considerations  ..............................  16
    6.4.1  Label Mapping Advertisements  ...........................  17
    6.4.2  Label Mapping Release  ..................................  17
    7      IANA Considerations  ....................................  17
    8      Security Considerations  ................................  18
    9      Full Copyright Statement  ...............................  18
   10      Intellectual Property Statement  ........................  18
   11      Nomative References  ....................................  19
   12      Informative References  .................................  20
   13      Author Information  .....................................  20














Martini, et al.                                                 [Page 3]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


1. Specification of Requirements

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119.


2. Special Note

   This document describes the so called "draft-martini" protocol with
   is used in many deployed implementations. This document and it's
   contents have been since superseded by the Pseudo Wire Edge to Edge
   Working Group specifications: [CONTROL], [ETHERNET], [ATM],
   [PPP/HDLC], [FRAME], [SATOP], [CEP] and related documents. This
   document serves as a documentation of current implementations, and
   MUST not be used for new implementations. The PWE3 LDP control
   [CONTROL] document, which is backward compatible with this document
   MUST be used for all new implementations of this protocol.


3. Introduction

   In an MPLS network, it is possible to carry the Protocol Data Units
   (PDUs) of layer 2 protocols by prepending an MPLS label stack to
   these PDUs. This document specifies the necessary label distribution
   procedures for accomplishing this using the encapsulation methods in
   [7]. We restrict discussion to the case of point-to-point transport.
   QoS related issues are not discussed in this draft. This document
   describes methods for transporting a number of protocols; in some
   cases, transporting a particular protocol may have several modes of
   operation. Each of these protocols and/or modes may be implemented
   independently.

   An accompanying document [8] also describes a method for transporting
   time division multiplexed (TDM) digital signals (TDM circuit
   emulation) over a packet-oriented MPLS network. The transmission
   system for circuit-oriented TDM signals is the Synchronous Optical
   Network (SONET)[5]/Synchronous Digital Hierarchy (SDH) [6]. To
   support TDM traffic, which includes voice, data, and private leased
   line service, the MPLS network must emulate the circuit
   characteristics of SONET/SDH payloads. MPLS labels and a new circuit
   emulation header are used to encapsulate TDM signals and provide the
   Circuit Emulation Service over MPLS (CEM).








Martini, et al.                                                 [Page 4]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


4. Tunnel Labels and VC Labels

   Suppose it is desired to transport layer 2 PDUs from ingress LSR R1
   to egress LSR R2, across an intervening MPLS network. We assume that
   there is an LSP from R1 to R2. That is, we assume that R1 can cause a
   packet to be delivered to R2 by pushing some label onto the packet
   and sending the result to one of its adjacencies. Call this label the
   "tunnel label", and the corresponding LSP the "tunnel LSP".

   The tunnel LSP merely gets packets from R1 to R2, the corresponding
   label doesn't tell R2 what to do with the payload, and in fact if
   penultimate hop popping is used, R2 may never even see the
   corresponding label.  (If R1 itself is the penultimate hop, a tunnel
   label may not even get pushed on.)  Thus if the payload is not an IP
   packet, there must be a label, which becomes visible to R2, that
   tells R2 how to treat the received packet.  Call this label the "VC
   label".

   So when R1 sends a layer 2 PDU to R2, it first pushes a VC label on
   its label stack, and then (if R1 is not adjacent to R2) pushes on a
   tunnel label.  The tunnel label gets the MPLS packet from R1 to R2;
   the VC label is not visible until the MPLS packet reaches R2.  R2's
   disposition of the packet is based on the VC label.

   Note that the tunnel could be a GRE encapsulated MPLS tunnel between
   R1 and R2. In this case R1 would be adjacent to R2, and only the VC
   label would be used, and the intervening network need only carry IP
   packets.

   If the payload of the MPLS packet is, for example, an ATM AAL5 PDU,
   the VC label will generally correspond to a particular ATM VC at R2.
   That is, R2 needs to be able to infer from the VC label the outgoing
   interface and the VPI/VCI value for the AAL5 PDU. If the payload is a
   Frame Relay PDU, then R2 needs to be able to infer from the VC label
   the outgoing interface and the DLCI value. If the payload is an
   Ethernet frame, then R2 needs to be able to infer from the VC label
   the outgoing interface, and perhaps the VLAN identifier. This process
   is unidirectional, and will be repeated independently for
   bidirectional operation. It is REQUIRED to assign the same VC ID, and
   VC type for a given circuit in both directions. The group ID (see
   below) MUST NOT be required to match in both directions. The
   transported frame MAY be modified when it reaches the egress router.
   If the header of the transported layer 2 frame is modified, this MUST
   be done at the egress LSR only.

   Note that the VC label must always be at the bottom of the label
   stack, and the tunnel label, if present, must be immediately above
   the VC label. Of course, as the packet is transported across the MPLS



Martini, et al.                                                 [Page 5]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


   network, additional labels may be pushed on (and then popped off) as
   needed. Even R1 itself may push on additional labels above the tunnel
   label. If R1 and R2 are directly adjacent LSRs, then it may not be
   necessary to use a tunnel label at all.

   This document does not specify a method for distributing the tunnel
   label or any other labels that may appear above the VC label on the
   stack. Any acceptable method of MPLS label distribution will do.

   This document does specify a method for assigning and distributing
   the VC label. Static label assignment MAY be used, and
   implementations SHOULD provide support for this. When signaling is
   used, the VC label MUST be distributed from R2 to R1 using LDP in the
   downstream unsolicited mode; this requires that an LDP session be
   created between R1 and R2. It should be noted that this LDP session
   is not necessarily transported along the same path as the Layer 2
   PDUs. [1] In addition, when using LDP to distribute the VC label,
   liberal label retention mode SHOULD be used. However, as required in
   [1], the label request operation (mainly used by conservative label
   retention mode) MUST be implemented. VC labels MUST be allocated from
   the per-platform label space.


   Note that this technique allows an unbounded number of layer 2 "VCs"
   to be carried together in a single "tunnel".  Thus it scales quite
   well in the network backbone.

   While this document currently defines the emulation of Frame Relay
   and ATM PVC services, it specifically does not preclude future
   enhancements to support switched service (SVC and SPVC) emulation.



5. Protocol-Specific Details

5.1. Frame Relay

   The Frame Relay PDUs are encapsulated according to the procedures
   defined in [7]. The MPLS edge LSR MUST provide Frame Relay PVC status
   signaling to the Frame Relay network. If the MPLS edge LSR detects a
   service affecting condition as defined in [2] Q.933 Annex A.5 sited
   in IA FRF1.1, it MUST withdraw the label that corresponds to the
   frame relay DLCI. The Egress LSR SHOULD generate the corresponding
   errors and alarms as defined in [2] on the egress Frame relay VC.







Martini, et al.                                                 [Page 6]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


5.2. ATM

5.2.1. ATM AAL5 VCC Transport

   ATM AAL5 CSPS-SDUs are encapsulated according to [7] ATM AAL5 CPCS-
   SDU mode. This mode allows the transport of ATM AAL5 CSPS-SDUs
   traveling on a particular ATM PVC across the MPLS network to another
   ATM PVC.


5.2.2. ATM Transparent Cell Transport

   This mode is similar to the Ethernet port mode. Every cell that is
   received at the ingress ATM port on the ingress LSR, R1, is
   encapsulated according to [7], ATM cell mode, and sent across the LSP
   to the egress LSR, R2. This mode allows an ATM port to be connected
   to only one other ATM port. [7] allows for grouping of multiple cells
   into a single MPLS frame. Grouping of ATM cells is OPTIONAL for
   transmission at the ingress LSR, R1. If the Egress LSR R2 supports
   cell concatenation the ingress LSR, R1, should only concatenate cells
   up to the "Maximum Number of concatenated ATM cells" parameter
   received as part of the FEC element.


5.2.3. ATM VCC and VPC Cell Transport

   This mode is similar to the ATM AAL5 VCC transport except that cells
   are transported. Every cell that is received on a pre-defined ATM
   PVC, or ATM PVP, at the ingress ATM port on the ingress LSR, R1, is
   encapsulated according to [7], ATM cell mode, and sent across the LSP
   to the egress LSR R2. Grouping of ATM cells is OPTIONAL for
   transmission at the ingress LSR, R1. If the Egress LSR R2 supports
   cell concatenation the ingress LSR, R1, MUST only concatenate cells
   up to the "Maximum Number of concatenated ATM cells in a frame"
   parameter received as part of the FEC element.


5.2.4. OAM Cell Support

   OAM cells MAY be transported on the VC LSP. When the LSR is operating
   in AAL5 CPCS-SDU transport mode if it does not support transport of
   ATM cells, the LSR MUST discard incoming MPLS frames on an ATM VC LSP
   that contain a VC label with the T bit set [7]. When operating in
   AAL5 SDU transport mode an LSR that supports transport of OAM cells
   using the T bit defined in [7], or an LSR operating in any of the
   three cell transport modes MUST follow the procedures outlined in [9]
   section 8 for mode 0 only, in addition to the applicable procedures
   specified in [6].



Martini, et al.                                                 [Page 7]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


5.2.4.1. OAM Cell Emulation Mode

   AN LSR that does not support transport of OAM cells across an LSP MAY
   provide OAM support on ATM PVCs using the following procedures:

   A pair of LSRs MAY emulate a bidirectional ATM VC by two uni-
   directional LSPs.  If an F5 end-to-end OAM cell is received from a
   ATM VC, by either LSR that is transporting this ATM VC, with a
   loopback indication value of 1, and the LSR has a label mapping for
   the ATM VC, then the LSR MUST decrement the loopback indication value
   and loop back the cell on the ATM VC. Otherwise the loopback cell
   MUST be discarded by the LSR.

   The ingress LSR, R1, may also optionally be configured to
   periodically generate F5 end-to-end loopback OAM cells on a VC. If
   the LSR fails to receive a response to an F5 end-to-end loopback OAM
   cell for a pre-defined period of time it MUST withdraw the label
   mapping for the VC.

   If an ingress LSR, R1, receives an AIS F5 OAM cell, fails to receive
   a pre-defined number of the End-to-End loop OAM cells, or a physical
   interface goes down, it MUST withdraw the label mappings for all VCs
   associated with the failure. When a VC label mapping is withdrawn,
   the egress LSR, R2, MUST generate AIS F5 OAM cells on the VC
   associated with the withdrawn label mapping. In this mode it is very
   useful to apply a unique group ID to each interface. In the case
   where a physical interface goes down, a wild card label withdraw can
   be sent to all LDP neighbors, greatly reducing the signaling response
   time.


5.2.5. ILMI Support

   An MPLS edge LSR MAY provide an ATM ILMI to the ATM edge switch. If
   an ingress LSR receives an ILMI message indicating that the ATM edge
   switch has deleted a VC, or if the physical interface goes down, it
   MUST withdraw the label mappings for all VCs associated with the
   failure. When a VC label mapping is withdrawn, the egress LSR SHOULD
   notify its client of this failure by deleting the VC using ILMI.

5.3. Ethernet VLAN

   The Ethernet frame will be encapsulated according to the procedures
   in [12].  It should be noted that if the VLAN identifier is modified
   by the egress LSR, according to the procedures outlined above, the
   Ethernet spanning tree protocol might fail to work properly. If the
   LSR detects a failure on the Ethernet physical port, or the port is
   administratively disabled, it MUST withdraw the label mappings for



Martini, et al.                                                 [Page 8]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


   all VCs associated with the port.

5.4. Ethernet

   The Ethernet frame will be encapsulated according to the procedures
   in [12].  If the LSR detects a failure on the Ethernet physical port,
   or the port is administratively disabled, the corresponding VC label
   mapping MUST be withdrawn.

5.5. HDLC

   HDLC frames are encapsulated according to the procedures in [7]. If
   the MPLS edge LSR detects that the physical link has failed, or the
   port is administratively disabled, it MUST withdraw the label mapping
   that corresponds to the HDLC link.

5.6. PPP

   PPP frames are encapsulated according to the procedures in [7]. If
   the MPLS edge LSR detects that the physical link has failed, or the
   port is administratively disabled, it MUST withdraw the label mapping
   that corresponds to the PPP link.


6. LDP

   The VC label bindings are distributed using the LDP downstream
   unsolicited mode described in [1]. The LSRs will establish an LDP
   session using the Extended Discovery mechanism described in [1,
   section 2.4.2 and 2.5], for this purpose a new type of FEC element is
   defined. The FEC element type is 128. [note1] Only a single VC FEC
   element MUST be advertised per LDP VC label.  The Virtual Circuit FEC
   element, is defined as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    VC tlv     |C|         VC Type             |VC info Length |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Group ID                                 |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        VC ID                                  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Interface parameters                    |
   |                              "                                |
   |                              "                                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+




Martini, et al.                                                 [Page 9]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


     - VC Type

       A 15 bit quantity containing a value which represents the type of
       VC. Assigned Values are:

               VC Type  Description

               0x0001   Frame Relay DLCI
               0x0002   ATM AAL5 VCC transport
               0x0003   ATM transparent cell transport
               0x0004   Ethernet VLAN
               0x0005   Ethernet
               0x0006   HDLC
               0x0007   PPP
               0x8008   CEM [8]
               0x0009   ATM VCC cell transport
               0x000A   ATM VPC cell transport

     - Control word bit (C)

       The highest order bit (C) of the VC type is used to flag the
       presence of a control word (defined in [7]) as follows:
               bit 15 = 1 control word present on this VC.
               bit 15 = 0 no control word present on this VC.

       Please see the section "C Bit handling procedures" for further
       explenation.

     - VC information length

       Length of the VC ID field and the interface parameters field in
       octets. If this value is 0, then it references all VCs using the
       specified group ID and there is no VC ID present, nor any
       interface parameters.

     - Group ID

       An arbitrary 32 bit value which represents a group of VCs that is
       used to create groups in the VC space. The group ID is intended
       to be used as a port index, or a virtual tunnel index. To
       simplify configuration a particular VC ID at ingress could be
       part of the virtual tunnel for transport to the egress router.
       The Group ID is very useful to send wild card label withdrawals
       to remote LSRs upon physical port failure.







Martini, et al.                                                [Page 10]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


     - VC ID

       A non zero 32-bit connection ID that together with the VC type,
       identifies a particular VC.

     - Interface parameters

       This variable length field is used to provide interface specific
       parameters, such as interface MTU.


6.1. Interface Parameters Field

   This field specifies interface specific parameters. When applicable,
   it MUST be used to validate that the LSRs, and the ingress and egress
   ports at the edges of the circuit, have the necessary capabilities to
   interoperate with each other. The field structure is defined as
   follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Parameter ID |    Length     |    Variable Length Value      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                         Variable Length Value                 |
   |                             "                                 |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   The parameter ID is defined as follows:
   Parameter   ID Length    Description

       0x01         4       Interface MTU in octets.
       0x02         4       Maximum Number of concatenated ATM cells.
       0x03   up to 82      Optional Interface Description string.
       0x04         4       CEM [8] Payload Bytes.
       0x05         4       CEM options.

   The Length field is defined as the length of the interface parameter
   including the parameter id and length field itself. Processing of the
   interface parameters should continue when encountering unknown
   interface parameters and they MUST be silently ignored.

     - Interface MTU

       A 2 octet value indicating the MTU in octets. This is the Maximum
       Transmission Unit, excluding encapsulation overhead, of the
       egress packet interface that will be transmitting the



Martini, et al.                                                [Page 11]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


       decapsulated PDU that is received from the MPLS network. This
       parameter is applicable only to VC types 1, 2, 4, 5, 6, and 7,
       and is REQUIRED for these VC types. If this parameter does not
       match in both directions of a specific VC, that VC MUST NOT be
       enabled.

     - Maximum Number of concatenated ATM cells

       A 2 octet value specifying the maximum number of concatenated ATM
       cells that can be processed as a single PDU by the egress LSR. An
       ingress LSR transmitting concatenated cells on this VC can
       concatenate a number of cells up to the value of this parameter,
       but MUST NOT exceed it. This parameter is applicable only to VC
       types 3, 9, and 0x0a, and is REQUIRED for these VC types. This
       parameter does not need to match in both directions of a specific
       VC.

     - Optional Interface Description string

       This arbitrary, OPTIONAL, interface description string can be
       used to send an administrative description text string to the
       remote LSR. This parameter is OPTIONAL, and is applicable to all
       VC types. The interface description parameter string length is
       variable, and can be from 0  to 80 octets.

     - Payload Bytes

       A 2 octet value indicating the the number of TDM payload octets
       contained in all packets on the CEM stream, from 48 to 1,023
       octets. All of the packets in a given CEM stream have the same
       number of payload bytes. Note that there is a possibility that
       the packet size may exceed the SPE size in the case of an STS-1
       SPE, which could cause two pointers to be needed in the CEM
       header, since the payload may contain two J1 bytes for
       consecutive SPEs. For this reason, the number of payload bytes
       must be less than or equal to 783 for STS-1 SPEs.

     - CEM Options.  An optional 16 Bit value of CEM Flags. See [8] for
       the definition of the bit values.












Martini, et al.                                                [Page 12]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


6.2. C Bit handling procedures

6.2.1. VC types for which the control word is REQUIRED

   The Label Mapping messages which are sent in order to set up these
   VCs MUST have c=1. When a Label Mapping message for a VC of one of
   these types is received, and c=0, a Label Release MUST be sent, with
   an "Illegal C-bit" status code. In this case, the VC will not come
   up.



6.2.2. VC types for which the control word is NOT mandatory

   If a system is capable of sending and receiving the control word on
   VC types for which the control word is not mandatory, then each such
   VC endpoint MUST be configurable with a parameter that specifies
   whether the use of the control word is PREFERRED or NOT PREFERRED.
   For each VC, there MUST be a default value of this parameter. This
   specification does NOT state what the default value should.

   If a system is NOT capable of sending and receiving the control word
   on VC types for which the control word is not mandatory, then it
   behaves as exactly as if it were configured for the use of the
   control word to be NOT PREFERRED.

   If a Label Mapping message for the VC has already been received, but
   no Label Mapping message for the VC has yet been sent, then the
   procedure is the following:
        -i. If the received Label Mapping message has c=0, send a Label
            Mapping message with c=0, and the control word is not used.
       -ii. If the received Label Mapping message has c=1, and the VC is
            locally configured such that the use of the control word is
            preferred, then send a Label Mapping message with c=1, and
            the control word is used.
      -iii. If the received Label Mapping message has c=1, and the VC is
            locally configured such that the use of the control word is
            not preferred or the control word is not supported, then act
            as if no Label Mapping message for the VC had been received
            (i.e., proceed to the next paragraph).

   If a Label Mapping message for the VC has not already been received
   (or if the received Label Mapping message had c=1 and either local
   configuration says that the use of the control word is not preferred
   or the control word is not supported), then send a Label Mapping
   message in which the c bit is set to correspond to the locally
   configured preference for use of the control word.  (I.e., set c=1 if
   locally configured to prefer the control word, set c=0 if locally



Martini, et al.                                                [Page 13]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


   configured to prefer not to use the control word or if the control
   word is not supported).

   The next action depends on what control message is next received for
   that VC.  The possibilities are:
        -i. A Label Mapping message with the same c bit value as
            specified in the Label Mapping message that was sent. VC
            setup is now complete, and the control word is used if c=1
            but not used if c=0.
       -ii. A Label Mapping message with c=1, but the Label Mapping
            message that was sent has c=0. In this case, ignore the
            received Label Mapping message, and continue to wait for the
            next control message for the VC.
      -iii. A Label Mapping message with c=0, but the Label Mapping
            message that was sent has c=1. In this case, send a Label
            Withdraw message with a "Wrong c-bit" status code, followed
            by a Label Mapping message that has c=0. VC setup is now
            complete, and the control word is not used.
       -iv. A Label Withdraw message with the "Wrong c-bit" status code.
            Treat as a normal Label Withdraw, but do not respond.
            Continue to wait for the next control message for the VC.

   If at any time after a Label Mapping message has been received, a
   corresponding Label Withdraw or Release is received, the action taken
   is the same as for any Label Withdraw or Release that might be
   received at any time.

   If both endpoints prefer the use of the control word, this procedure
   will cause it to be used. If either endpoint prefers not to use the
   control word, or does not support the control word, this procedure
   will cause it not to be used. If one endpoint prefers to use the
   control word but the other does not, the one that prefers not to use
   it is has no extra protocol to execute, it just waits for a Label
   Mapping message that has c=0.

   The following diagram illustrate the above procedures:















Martini, et al.                                                [Page 14]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


                   ------------------
               Y   | Received Label |       N
            -------|  Mapping Msg?  |--------------
            |      ------------------             |
            |                                     |
        --------------                            |
        |            |                            |
        |            |                            |
     -------      -------                         |
     | C=0 |      | C=1 |                         |
     -------      -------                         |
        |            |                            |
        |            |                            |
        |    ----------------                     |
        |    | Control Word |     N               |
        |    |    Capable?  |-----------          |
        |    ----------------          |          |
        |          Y |                 |          |
        |            |                 |          |
        |   ----------------           |          |
        |   | Control Word |  N        |          |
        |   |  Preferred?  |----       |          |
        |   ----------------   |       |          |
        |          Y |         |       |          |
        |            |         |       |   ----------------
        |            |         |       |   | Control Word |
        |            |         |       |   |  Preferred?  |
        |            |         |       |   ----------------
        |            |         |       |     N |     Y |
        |            |         |       |       |       |
      Send         Send      Send    Send    Send    Send
       C=0          C=1       C=0     C=0     C=0     C=1
                               |       |       |       |
                               |       |       |       |
                            ----------------------------------
                            | If receive the same as sent,   |
                            | VC setup is complete. If not:  |
                            ----------------------------------
                               |       |       |       |
                               |       |       |       |
                              ------------------- -----------
                              |     Receive     | | Receive |
                              |       C=1       | |   C=0   |
                              ------------------- -----------
                                       |               |
                                       |               |
                                 Wait for the        Send
                                 next message     Wrong C-Bit



Martini, et al.                                                [Page 15]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


                                                       |
                                                       |
                                                  Send Label
                                               Mapping Message
                                                   with C=0


6.2.3. Status codes

   RFC 3036 has a range of Status Code values which are assigned by IANA
   on a First Come, First Served basis. These are in the range
   0x20000000-0x3effffff [note 2]. The following new status codes are
   defined:

        0x20000001 "Illegal C-Bit"
        0x20000002 "Wrong C-Bit"


6.3. LDP label Withdrawal procedures

   As mentioned above the Group ID field can be used to withdraw all VC
   labels associated with a particular group ID. This procedure is
   OPTIONAL, and if it is implemented the LDP label withdraw message
   should be as follows: the VC information length field is set to 0,
   the VC ID field is not present, and the interface parameters field is
   not present. For the purpose of this document this is called the
   "wild card withdraw procedure", and all LSRs implementing this design
   are REQUIRED to accept such a withdraw message, but are not required
   to send it.

   The interface parameters field MUST NOT be present in any LDP VC
   label withdrawal message or release message. A wild card release
   message MUST include only the group ID.A Label Release message
   initiated from the imposition router must always include the VC ID.


6.4. Sequencing Considerations

   In the case where the router considers the sequence number field in
   the control word, it is important to note the following when
   advertising labels










Martini, et al.                                                [Page 16]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


6.4.1. Label Mapping Advertisements

   After a label has been withdrawn by the disposition router and/or
   released by the imposition router, care must be taken to not re-
   advertise (re-use) the released label until the disposition router
   can be reasonably certain that old packets containing the released
   label no longer persist in the MPLS network.

   This precaution is required to prevent the imposition router from
   restarting packet forwarding with sequence number of 1 when it
   receives the same label mapping if there are still older packets
   persisting in the network with sequence number between 1 and 32768.
   For example, if there is a packet with sequence number=n where n is
   in the interval[1,32768] traveling through the network, it would be
   possible for the disposition router to receive that packet after it
   re-advertises the label. Since the label has been released by the
   imposition router, the disposition router SHOULD be expecting the
   next packet to arrive with sequence number to be 1. Receipt of a
   packet with sequence number equal to n will result in n packets
   potentially being rejected by the disposition router until the
   imposition router imposes a sequence number of n+1 into a packet.
   Possible methods to avoid this is for the disposition router to
   always advertise a different VC label, or for the disposition router
   to wait for a sufficient time before attempting to re-advertised a
   recently released label. This is only an issue when sequence number
   processing at the disposition router is enabled.


6.4.2. Label Mapping Release

   In situations where the imposition router wants to restart forwarding
   of packets with sequence number 1, the router shall 1) Send to
   disposition router a label mapping release, and 2) Send to
   disposition router a label mapping request. When sequencing is
   supported, advertisement of a VC label in response to a label mapping
   request MUST also consider the issues discussed in 5.3.1


7. IANA Considerations

   As specified in this document, a Virtual Circuit FEC element contains
   the VC Type field. VC Type value 0 is reserved. VC Type values 1
   through 10 are defined in this document. VC Type values 11 through 63
   are to be assigned by IANA using the "IETF Consensus" policy defined
   in RFC2434. VC Type values 64 through 127 are to be assigned by IANA,
   using the "First Come First Served" policy defined in RFC2434. VC
   Type values 128 through 32767 are vendor-specific, and values in this
   range are not to be assigned by IANA.



Martini, et al.                                                [Page 17]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


   As specified in this document, a Virtual Circuit FEC element contains
   the Interface Parameters field, which is a list of one or more
   parameters, and each parameter is identified by the Parameter ID
   field. Parameter ID value 0 is reserved. Parameter ID values 1
   through 5 are defined in this document.  Parameter ID values 6
   through 63 are to be assigned by IANA using the "IETF Consensus"
   policy defined in RFC2434. Parameter ID values 64 through 127 are to
   be assigned by IANA, using the "First Come First Served" policy
   defined in RFC2434. Parameter ID values 128 through 255 are vendor-
   specific, and values in this range are not to be assigned by IANA.


8. Security Considerations

   This document does not affect the underlying security issues of MPLS.


9. Full Copyright Statement

   Copyright (C) The Internet Society (2006).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET
   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,
   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE
   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


10. Intellectual Property Statement

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of



Martini, et al.                                                [Page 18]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at ietf-
   ipr@ietf.org.


11. Nomative References

   [CONTROL] "Pseudowire Setup and Maintenance using LDP",
        Martini, L., et al., draft-ietf-pwe3-control-protocol-16.txt,
        April 2005. (work in progress)

   [CEP] "SONET/SDH Circuit Emulation Service Over Packet (CEP)",
        draft-ietf-pwe3-sonet-11.txt (work in progress)

   [SAToP] "Structure-Agnostic TDM over Packet (SAToP)",
        draft-ietf-pwe3-satop-03.txt (work in progress)

   [FRAME] "Frame Relay over Pseudo-Wires",
        draft-ietf-pwe3-frame-relay-02.txt (work in progress )

   [ATM] "Encapsulation Methods for Transport of ATM Cells/Frame Over IP
        and MPLS Networks", draft-ietf-pwe3-atm-encap-05.txt (work in
        progress)

   [PPPHDLC] "Encapsulation Methods for Transport of PPP/HDLC Frames
        Over IP and MPLS Networks",
        draft-ietf-pwe3-hdlc-ppp-encap-05.txt (work in progress)

   [ETH] "Encapsulation Methods for Transport of Ethernet Frames Over
        IP/MPLS Networks", draft-ietf-pwe3-ethernet-encap-06.txt.
        (work in progress)

   [1] "LDP Specification." L. Andersson, P. Doolan, N. Feldman, A.
        Fredette, B. Thomas. January 2001. RFC3036

   [2] ITU-T Recommendation Q.933, and Q.922 Specification for Frame
        Mode Basic call control, ITU Geneva 1995

   [3] "MPLS Label Stack Encoding", E. Rosen, Y. Rekhter, D. Tappan, G.
        Fedorkow, D. Farinacci, T. Li, A. Conta. RFC3032





Martini, et al.                                                [Page 19]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006


   [4] "IEEE 802.3ac-1998" IEEE standard specification.

   [5] American National Standards Institute, "Synchronous Optical
        Network Formats," ANSI T1.105-1995.

   [6] ITU Recommendation G.707, "Network Node Interface For The
        Synchronous Digital Hierarchy", 1996.


12. Informative References

   [7] "Encapsulation Methods for Transport of Layer 2 Frames Over MPLS"
        draft-martini-l2circuit-encap-mpls-06.txt ( Work in progress )

   [8] "SONET/SDH Circuit Emulation Service Over MPLS (CEM)
        Encapsulation", draft-malis-sonet-ces-mpls-05.txt
        (Work in progress)

   [9] "Frame Based ATM over SONET/SDH Transport (FAST)," 2000.

   [note1] FEC element type 128 is pending IANA approval.
   [note2] Status codes assigment is pending IANA approval.

13. Author Information


   Luca Martini
   Cisco Systems, Inc.
   9155 East Nichols Avenue, Suite 400
   Englewood, CO, 80112
   e-mail: lmartini@cisco.com


   Nasser El-Aawar
   Level 3 Communications, LLC.
   1025 Eldorado Blvd.
   Broomfield, CO, 80021
   e-mail: nna@level3.net













Martini, et al.                                                [Page 20]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006



   Giles Heron
   Tellabs
   Abbey Place
   24-28 Easton Street
   High Wycombe
   Bucks
   HP11 1NT
   UK
   e-mail: giles.heron@tellabs.com


   Dimitri Stratton Vlachos
   Mazu Networks, Inc.
   125 Cambridgepark Drive
   Cambridge, MA 02140
   e-mail: d@mazunetworks.com


   Dan Tappan
   Cisco Systems, Inc.
   250 Apollo Drive
   Chelmsford, MA, 01824
   e-mail: tappan@cisco.com


   Jayakumar Jayakumar,
   Cisco Systems Inc.
   225, E.Tasman, MS-SJ3/3,
   San Jose, CA, 95134
   e-mail: jjayakum@cisco.com


   Alex Hamilton,
   Cisco Systems Inc.
   285 W. Tasman, MS-SJCI/3/4,
   San Jose, CA, 95134
   e-mail: tahamilt@cisco.com


   Eric Rosen
   Cisco Systems, Inc.
   250 Apollo Drive
   Chelmsford, MA, 01824
   e-mail: erosen@cisco.com






Martini, et al.                                                [Page 21]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006



   Steve Vogelsang
   Laurel Networks, Inc.
   Omega Corporate Center
   1300 Omega Drive
   Pittsburgh, PA 15205
   e-mail: sjv@laurelnetworks.com


   John Shirron
   Omega Corporate Center
   1300 Omega Drive
   Pittsburgh, PA 15205
   Laurel Networks, Inc.
   e-mail: jshirron@laurelnetworks.com


   Toby Smith
   Omega Corporate Center
   1300 Omega Drive
   Pittsburgh, PA 15205
   Laurel Networks, Inc.
   e-mail: tob@laurelnetworks.com


   Andrew G. Malis
   Tellabs
   90 Rio Robles Dr.
   San Jose, CA 95134
   e-mail: Andy.Malis@tellabs.com


   Vinai Sirkay
   Vivace Networks, Inc.
   2730 Orchard Parkway
   San Jose, CA 95134
   e-mail: sirkay@technologist.com


   Vasile Radoaca
   Nortel Networks
   600  Technology Park
   Billerica MA 01821
   e-mail: vasile@nortelnetworks.com







Martini, et al.                                                [Page 22]

Internet Draft draft-martini-l2circuit-trans-mpls-17.txt    January 2006



   Chris Liljenstolpe
   Cable & Wireless
   11700 Plaza America Drive
   Reston, VA 20190
   e-mail: chris@cw.net


   Dave Cooper
   Global Crossing
   960 Hamlin Court
   Sunnyvale, CA 94089
   e-mail: dcooper@gblx.net


   Kireeti Kompella
   Juniper Networks
   1194 N. Mathilda Ave
   Sunnyvale, CA 94089
   e-mail: kireeti@juniper.net































Martini, et al.                                                [Page 23]

